app/Models/ModelUser.php

    public function AllData()
    {
        return $this->db->table('tbl_user')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `tbl_user`